In [15]:
import mysql.connector   #con esto conectamos a la base de datos

db = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = '2204William1401',
    database = 'semana_7')
       
print("Conexion establecida")
    
mycursor = db.cursor()   # 'cursor' nos permite generar objetos para ejecutar sentencias SQL en python

Conexion establecida

In [17]:
mycursor = db.cursor()  # con esto creamos la tabla 'alumnos' e imprimimos sus caracteristicas
mycursor.execute("CREATE TABLE alumnos (personID int PRIMARY KEY AUTO_INCREMENT, rut VARCHAR(12), nombre VARCHAR(20), \
                 apellidos VARCHAR(30), direccion VARCHAR(50), anio int, asignaturas VARCHAR(100), actividades VARCHAR(100))")

mycursor.execute("DESCRIBE alumnos")

for i in mycursor:
    print(i)

('personID', b'int', 'NO', bytearray(b'PRI'), None, 'auto_increment')
('rut', b'varchar(12)', 'YES', bytearray(b''), None, '')
('nombre', b'varchar(20)', 'YES', bytearray(b''), None, '')
('apellidos', b'varchar(30)', 'YES', bytearray(b''), None, '')
('direccion', b'varchar(50)', 'YES', bytearray(b''), None, '')
('anio', b'int', 'YES', bytearray(b''), None, '')
('asignaturas', b'varchar(100)', 'YES', bytearray(b''), None, '')
('actividades', b'varchar(100)', 'YES', bytearray(b''), None, '')

In [18]:
mycursor = db.cursor()  # con esto creamos la tabla 'apoderados' e imprimimos sus caracteristicas
mycursor.execute("CREATE TABLE apoderados \ 
                 (personID int PRIMARY KEY AUTO_INCREMENT, rut VARCHAR(12), nombre VARCHAR(20), apellidos VARCHAR(30), direccion VARCHAR(50))")

mycursor.execute("DESCRIBE apoderados")

for i in mycursor:
    print(i)

('personID', b'int', 'NO', bytearray(b'PRI'), None, 'auto_increment')
('rut', b'varchar(12)', 'YES', bytearray(b''), None, '')
('nombre', b'varchar(20)', 'YES', bytearray(b''), None, '')
('apellidos', b'varchar(30)', 'YES', bytearray(b''), None, '')
('direccion', b'varchar(50)', 'YES', bytearray(b''), None, '')

In [31]:
mycursor = db.cursor()  # con esto insertamos datos en la tabla 'alumnos'
sql = "INSERT INTO alumnos (rut, nombre, apellidos, direccion, anio, asignaturas, actividades) VALUES (%s,%s,%s,%s,%s,%s,%s)"
#val = ("19784565-9", "Carlo", "Arancibia Romero", "Calle 13 numero 682", 3, "Fisica, calculo, quimica", "Baloncesto, Ajedrez")
#val = ("21548655-8", "Valentina", "Castro Soto", "Pasaje Manolito numero 43", 2, "Biologia, ingles, histologia", "Sin actividades extras")
val = ("21457585-K", "Sebastian", "Torres Ramirez", "Ecuador 458 depto 206", 4, "Quimica organica 2, analisis instrumental, biologia molecular", "Tennis")

mycursor.execute(sql, val)
db.commit()

mycursor.execute("SELECT * FROM alumnos") # con esto mostramos los datos guardados en la tabla 'alumnos'

for i in mycursor:
    print(i)

(1, '19784565-9', 'Carlo', 'Arancibia Romero', 'Calle 13 numero 682', 3, 'Fisica, calculo, quimica', 'Baloncesto, Ajedrez')
(2, '21548655-8', 'Valentina', 'Castro Soto', 'Pasaje Manolito numero 43', 2, 'Biologia, ingles, histologia', 'Sin actividades extras')
(3, '21457585-K', 'Sebastian', 'Torres Ramirez', 'Ecuador 458 depto 206', 4, 'Quimica organica 2, analisis instrumental, biologia molecular', 'Tennis')

In [34]:
mycursor = db.cursor()  # con esto insertamos datos en la tabla 'apoderados'
sql = "INSERT INTO apoderados (rut, nombre, apellidos, direccion) VALUES (%s,%s,%s,%s)"
#val = ("12547514-2", "Eduardo", "Arancibia Diaz", "Calle 13 numero 682")
#val = ("14245578-5", "Hilda", "Castro Vidal", "Pasaje Manolito numero 43")
val = ("14547848-6", "Nicole", "Ramirez Hernandez", "Ecuador 458 depto 206")

mycursor.execute(sql, val)
db.commit()

mycursor.execute("SELECT * FROM apoderados") # con esto mostramos los datos guardados en la tabla 'apoderados'

for i in mycursor:
    print(i)

(1, '12547514-2', 'Eduardo', 'Arancibia Diaz', 'Calle 13 numero 682')
(2, '14245578-5', 'Hilda', 'Castro Vidal', 'Pasaje Manolito numero 43')
(3, '14547848-6', 'Nicole', 'Ramirez Hernandez', 'Ecuador 458 depto 206')

In [35]:
mycursor = db.cursor()  # con esto borramos el dato seleccionado de la tabla 'alumnos'
sql = "DELETE FROM alumnos WHERE rut = '21548655-8'"
mycursor.execute(sql)
db.commit()

mycursor.execute("SELECT * FROM alumnos")

for i in mycursor:
    print(i)

(1, '19784565-9', 'Carlo', 'Arancibia Romero', 'Calle 13 numero 682', 3, 'Fisica, calculo, quimica', 'Baloncesto, Ajedrez')
(3, '21457585-K', 'Sebastian', 'Torres Ramirez', 'Ecuador 458 depto 206', 4, 'Quimica organica 2, analisis instrumental, biologia molecular', 'Tennis')

In [36]:
mycursor = db.cursor()  # con esto borramos el dato seleccionado de la tabla 'apoderados'
sql = "DELETE FROM apoderados WHERE rut = '14245578-5'"
mycursor.execute(sql)
db.commit()

mycursor.execute("SELECT * FROM apoderados")

for i in mycursor:
    print(i)

(1, '12547514-2', 'Eduardo', 'Arancibia Diaz', 'Calle 13 numero 682')
(3, '14547848-6', 'Nicole', 'Ramirez Hernandez', 'Ecuador 458 depto 206')